src/InformationRegisters/дсфНастройкиДоступаКАпи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>дсфНастройкиДоступаКАпи</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Префикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>КлючАпи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/дсфНастройкиДоступаКАпи/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция КлючАпиЗарегистрирован(Знач КлючАпи) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	дсфНастройкиДоступаКАпи.КлючАпи КАК КлючАпи
	|ИЗ
	|	РегистрСведений.дсфНастройкиДоступаКАпи КАК дсфНастройкиДоступаКАпи
	|ГДЕ
	|	дсфНастройкиДоступаКАпи.КлючАпи = &КлючАпи";
	
	Запрос.УстановитьПараметр("КлючАпи", КлючАпи);
	
	Результат = Запрос.Выполнить();
	
	Возврат Не Результат.Пустой();
	
КонецФункции

Функция КлиентПоКлючуАпи(Знач КлючАпи) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	дсфНастройкиДоступаКАпи.Клиент КАК Клиент
	|ИЗ
	|	РегистрСведений.дсфНастройкиДоступаКАпи КАК дсфНастройкиДоступаКАпи
	|ГДЕ
	|	дсфНастройкиДоступаКАпи.КлючАпи = &КлючАпи";
	
	Запрос.УстановитьПараметр("КлючАпи", КлючАпи);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
		
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Клиент;
		
	КонецЦикла;
		
	Возврат Неопределено;
	
КонецФункции

Функция ПрефиксКлиентаПоКлючуАпи(Знач КлючАпи) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	дсфНастройкиДоступаКАпи.Префикс КАК Префикс
	               |ИЗ
	               |	РегистрСведений.дсфНастройкиДоступаКАпи КАК дсфНастройкиДоступаКАпи
	               |ГДЕ
	               |	дсфНастройкиДоступаКАпи.КлючАпи = &КлючАпи";
	
	Запрос.УстановитьПараметр("КлючАпи", КлючАпи);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат "";
		
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Префикс;
		
	КонецЦикла;
		
	Возврат "";
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий
// Код процедур и функций
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти
	
#КонецЕсли
